Revit 2027 API
MEPCalculationServerInfo Constructor
Overload List
Name | Description
MEPCalculationServerInfo() |  Constructs a new MEPCalculationServerInfo with default settings.
MEPCalculationServerInfo(IExternalServer) |  Create a new MEPCalculationServerInfo by an external server.
MEPCalculationServerInfo(MEPCalculationServerInfo) |  Constructs a new copy of the input MEPCalculationServerInfo object.
Top
See Also
Reference
MEPCalculationServerInfo Class
Autodesk.Revit.DB Namespace